In [1]:
import pandas as pd

## Intro to the Merging, Joining, and Concatenating Module

In [5]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week1

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
245          413        9
246          926        6
247          134        3
248          396        6
249          535       10

[250 rows x 2 columns]

In [6]:
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
week2

     Customer ID  Food ID
0            688       10
1            813        7
2            495       10
3            189        5
4            267        3
..           ...      ...
245          783       10
246          556       10
247          547        9
248          252        9
249          249        6

[250 rows x 2 columns]

In [7]:
foods = pd.read_csv("Restaurant - Foods.csv")
foods

   Food ID   Food Item  Price
0        1       Sushi   3.99
1        2     Burrito   9.99
2        3        Taco   2.99
3        4  Quesadilla   4.25
4        5       Pizza   2.49
5        6       Pasta  13.99
6        7       Steak  24.99
7        8       Salad  11.25
8        9       Donut   0.99
9       10       Drink   1.75

In [4]:
customers = pd.read_csv("Restaurant - Customers.csv")
customers

,ID,First Name,Last Name,Gender,Company,Occupation
0,1,Joseph,Perkins,Male,Dynazzy,Community Outreach Specialist
1,2,Jennifer,Alvarez,Female,DabZ,Senior Quality Engineer
2,3,Roger,Black,Male,Tagfeed,Account Executive
3,4,Steven,Evans,Male,Fatz,Registered Nurse
4,5,Judy,Morrison,Female,Demivee,Legal Assistant
...,...,...,...,...,...,...
995,996,Debra,Garcia,Female,Dazzlesphere,Structural Engineer
996,997,Douglas,Bishop,Male,Livepath,Developer I
997,998,Frank,Franklin,Male,Brainverse,Nurse Practicioner
998,999,Jessica,Burns,Female,Babbleblab,Financial Advisor
999,1000,Brian,Daniels,Male,Tazzy,Physical Therapy Assistant

## The pd.concat() Method, Part 1

In [8]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
foods = pd.read_csv("Restaurant - Foods.csv")
customers = pd.read_csv("Restaurant - Customers.csv")

In [9]:
len(week1)

250

In [10]:
len(week2)

250

In [16]:
pd.concat([week1,week2], ignore_index=True) 
# by default indexes are passed along, simply concatenated.
# to fix, use the ignore_index=True

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

## The pd.concat() Method, Part 2

In [17]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
foods = pd.read_csv("Restaurant - Foods.csv")
customers = pd.read_csv("Restaurant - Customers.csv")

In [18]:
pd.concat([week1,week2], ignore_index=True)

     Customer ID  Food ID
0            537        9
1             97        4
2            658        1
3            202        2
4            155        9
..           ...      ...
495          783       10
496          556       10
497          547        9
498          252        9
499          249        6

[500 rows x 2 columns]

In [21]:
# to keep a marker of each original dataframe, use 'keys'. creates a second index:
pd.concat([week1,week2], keys = ["Week1","Week2"])

           Customer ID  Food ID
Week1 0            537        9
      1             97        4
      2            658        1
      3            202        2
      4            155        9
...                ...      ...
Week2 245          783       10
      246          556       10
      247          547        9
      248          252        9
      249          249        6

[500 rows x 2 columns]

In [22]:
sales = pd.concat([week1,week2], keys = ["Week1","Week2"])

## The .append() Method on a Dataframe

In [23]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
foods = pd.read_csv("Restaurant - Foods.csv")
customers = pd.read_csv("Restaurant - Customers.csv")

In [25]:
week2.append(week1, ignore_index=True)

     Customer ID  Food ID
0            688       10
1            813        7
2            495       10
3            189        5
4            267        3
..           ...      ...
495          413        9
496          926        6
497          134        3
498          396        6
499          535       10

[500 rows x 2 columns]

## Inner Joins, Part 1

In [ ]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
foods = pd.read_csv("Restaurant - Foods.csv")
customers = pd.read_csv("Restaurant - Customers.csv")

In [ ]:
# inner join merges two dataframes on commonly shared values

In [28]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [27]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [29]:
week1.merge(week2, how="inner", on = "Customer ID")
# how="inner" is default
## Food ID_x is week 1, Food ID_y is week 2

    Customer ID  Food ID_x  Food ID_y
0           537          9          5
1           155          9          3
2           155          1          3
3           503          5          8
4           503          5          9
..          ...        ...        ...
57          945          5          4
58          343          3          5
59          343          3          2
60          343          3          7
61          621          9          6

[62 rows x 3 columns]

In [ ]:
# Why do we have multiple rows for 155 above?

In [31]:
week1[week1["Customer ID"]==155]

    Customer ID  Food ID
4           155        9
17          155        1

In [32]:
week2[week2["Customer ID"]==155]

     Customer ID  Food ID
208          155        3

In [34]:
## Add suffixes to properly rename data frames

week1.merge(week2, how="inner", on = "Customer ID",suffixes=[" - Week1", " - Week2"])

    Customer ID  Food ID - Week1  Food ID - Week2
0           537                9                5
1           155                9                3
2           155                1                3
3           503                5                8
4           503                5                9
..          ...              ...              ...
57          945                5                4
58          343                3                5
59          343                3                2
60          343                3                7
61          621                9                6

[62 rows x 3 columns]

## Inner Joins, Part 2

In [35]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
foods = pd.read_csv("Restaurant - Foods.csv")
customers = pd.read_csv("Restaurant - Customers.csv")

In [36]:
week1.merge(week2, how="inner", on = ["Customer ID","Food ID"])
# Returns customers who bought the same food id both weeks

   Customer ID  Food ID
0          304        3
1          540        3
2          937       10
3          233        3
4           21        4
5           21        4
6          922        1
7          578        5
8          578        5

In [ ]:
# why are their duplicates for ID 21 amd ID

In [38]:
week1[week1["Customer ID"]==21] # bought the same item twice in week 1

     Customer ID  Food ID
101           21        4
212           21        4

In [37]:
week2[week2["Customer ID"]==21] # and once in week 2

    Customer ID  Food ID
30           21        4

## Outer Joins

In [ ]:
# Joins observations which are found in either or both dataframes

In [ ]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
foods = pd.read_csv("Restaurant - Foods.csv")
# customers = pd.read_csv("Restaurant - Customers.csv")

In [47]:
# Outer Join example
# added indicator=True to include the '_merge' column
week1.merge(week2,how="outer",on="Customer ID",suffixes=[" - Wk1"," - Wk2"],indicator=True)

     Customer ID  Food ID - Wk1  Food ID - Wk2      _merge
0            537            9.0            5.0        both
1             97            4.0            NaN   left_only
2            658            1.0            NaN   left_only
3            202            2.0            NaN   left_only
4            155            9.0            3.0        both
..           ...            ...            ...         ...
449          855            NaN            4.0  right_only
450          559            NaN           10.0  right_only
451          276            NaN            4.0  right_only
452          556            NaN           10.0  right_only
453          252            NaN            9.0  right_only

[454 rows x 4 columns]

In [51]:
merged = week1.merge(week2,how="outer",on="Customer ID",suffixes=[" - Wk1"," - Wk2"],indicator=True)
merged["_merge"].value_counts()

right_only    197
left_only     195
both           62
Name: _merge, dtype: int64

In [52]:
# returning only those values which are NOT in both. ie unique to one or the other

In [54]:
mask = merged["_merge"].isin(["left_only","right_only"])
merged[mask]

     Customer ID  Food ID - Wk1  Food ID - Wk2      _merge
1             97            4.0            NaN   left_only
2            658            1.0            NaN   left_only
3            202            2.0            NaN   left_only
6            213            8.0            NaN   left_only
7            600            1.0            NaN   left_only
..           ...            ...            ...         ...
449          855            NaN            4.0  right_only
450          559            NaN           10.0  right_only
451          276            NaN            4.0  right_only
452          556            NaN           10.0  right_only
453          252            NaN            9.0  right_only

[392 rows x 4 columns]

## Left Joins

In [55]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
foods = pd.read_csv("Restaurant - Foods.csv")
customers = pd.read_csv("Restaurant - Customers.csv")

In [56]:
week1.merge(foods,how="left")

     Customer ID  Food ID   Food Item  Price
0            537        9       Donut   0.99
1             97        4  Quesadilla   4.25
2            658        1       Sushi   3.99
3            202        2     Burrito   9.99
4            155        9       Donut   0.99
..           ...      ...         ...    ...
245          413        9       Donut   0.99
246          926        6       Pasta  13.99
247          134        3        Taco   2.99
248          396        6       Pasta  13.99
249          535       10       Drink   1.75

[250 rows x 4 columns]

In [57]:
week1.merge(foods,how="left", on = "Food ID")

     Customer ID  Food ID   Food Item  Price
0            537        9       Donut   0.99
1             97        4  Quesadilla   4.25
2            658        1       Sushi   3.99
3            202        2     Burrito   9.99
4            155        9       Donut   0.99
..           ...      ...         ...    ...
245          413        9       Donut   0.99
246          926        6       Pasta  13.99
247          134        3        Taco   2.99
248          396        6       Pasta  13.99
249          535       10       Drink   1.75

[250 rows x 4 columns]

In [ ]:
# sort = True will sort on the matching column

In [58]:
week1.merge(foods,how="left", on = "Food ID", sort=True)

     Customer ID  Food ID Food Item  Price
0            658        1     Sushi   3.99
1            600        1     Sushi   3.99
2            155        1     Sushi   3.99
3            341        1     Sushi   3.99
4             20        1     Sushi   3.99
..           ...      ...       ...    ...
245          809       10     Drink   1.75
246          584       10     Drink   1.75
247          274       10     Drink   1.75
248          151       10     Drink   1.75
249          535       10     Drink   1.75

[250 rows x 4 columns]

## The left_on and right_on Parameters

In [ ]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
foods = pd.read_csv("Restaurant - Foods.csv")
customers = pd.read_csv("Restaurant - Customers.csv")

In [ ]:
# what happens when the columns you're joining on do not have same names?

In [61]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [60]:
customers.head(2)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer

In [62]:
# make use of left_on and right_on arguments
week2.merge(customers, how = "left", left_on = "Customer ID", right_on = "ID")

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,688,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,813,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,495,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,189,Roger,Gordon,Male,Skilith,Operator
4,267,3,267,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...,...
245,783,10,783,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,556,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,547,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,252,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,249,Anthony,Carpenter,Male,Shuffletag,Health Coach I

In [67]:
# by default, the above will keep both Customer ID and ID
# to drop, use .drop("ID", axis="columns")
week2.merge(customers, how = "left", left_on = "Customer ID", right_on = "ID").drop("ID", axis="columns")

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,688,10,Carl,Williamson,Male,Thoughtmix,Graphic Designer
1,813,7,Johnny,Walker,Male,Kayveo,Developer II
2,495,10,Deborah,Little,Female,Babbleblab,VP Accounting
3,189,5,Roger,Gordon,Male,Skilith,Operator
4,267,3,Matthew,Wood,Male,Agimba,Product Engineer
...,...,...,...,...,...,...,...
245,783,10,Phyllis,Meyer,Female,Voolia,Information Systems Manager
246,556,10,Samuel,Bailey,Male,Oyoloo,Nurse
247,547,9,Tina,Watkins,Female,Thoughtstorm,Accountant II
248,252,9,Douglas,Powell,Male,Jetwire,Geologist IV
249,249,6,Anthony,Carpenter,Male,Shuffletag,Health Coach I

## Merging by Indexes with the left_index and right_index Parameters

In [71]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
foods = pd.read_csv("Restaurant - Foods.csv", index_col="Food ID")
customers = pd.read_csv("Restaurant - Customers.csv", index_col="ID")

In [73]:
foods.head(2)

        Food Item  Price
Food ID
1           Sushi   3.99
2         Burrito   9.99

In [75]:
customers.head(2)

   First Name Last Name  Gender  Company                     Occupation
ID
1      Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
2    Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer

In [76]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [78]:
week1.merge(customers, how="left", left_on="Customer ID", right_index=True)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III
...,...,...,...,...,...,...,...
245,413,9,Diane,Bailey,Female,Wikibox,Technical Writer
246,926,6,Anne,Wagner,Female,Skyba,Legal Assistant
247,134,3,Diana,Hall,Female,Quinu,Financial Advisor
248,396,6,Juan,Romero,Male,Zoonder,Analyst Programmer
249,535,10,Nancy,Cox,Female,Trudeo,Research Associate

In [79]:
sales = week1.merge(customers, how="left", left_on="Customer ID", right_index=True)

In [81]:
sales.merge(foods, how="left", left_on ="Food ID", right_index=True)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,Sushi,3.99
3,202,2,Louis,Campbell,Male,Rhynoodle,Account Representative III,Burrito,9.99
4,155,9,Carolyn,Diaz,Female,Gigazoom,Database Administrator III,Donut,0.99
...,...,...,...,...,...,...,...,...,...
245,413,9,Diane,Bailey,Female,Wikibox,Technical Writer,Donut,0.99
246,926,6,Anne,Wagner,Female,Skyba,Legal Assistant,Pasta,13.99
247,134,3,Diana,Hall,Female,Quinu,Financial Advisor,Taco,2.99
248,396,6,Juan,Romero,Male,Zoonder,Analyst Programmer,Pasta,13.99
249,535,10,Nancy,Cox,Female,Trudeo,Research Associate,Drink,1.75

In [82]:
sales = sales.merge(foods, how="left", left_on ="Food ID", right_index=True)

In [83]:
sales.head(3)

,Customer ID,Food ID,First Name,Last Name,Gender,Company,Occupation,Food Item,Price
0,537,9,Cheryl,Carroll,Female,Zoombeat,Registered Nurse,Donut,0.99
1,97,4,Amanda,Watkins,Female,Ozu,Account Coordinator,Quesadilla,4.25
2,658,1,Patrick,Webb,Male,Browsebug,Community Outreach Specialist,Sushi,3.99

In [ ]:
## Merging on common data indexes

In [86]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [87]:
week2.head(2)

   Customer ID  Food ID
0          688       10
1          813        7

In [90]:
weeks = week1.merge(week2, how="left", left_index=True,right_index=True,suffixes= [" -wk1", " -wk2"])

In [91]:
weeks

     Customer ID -wk1  Food ID -wk1  Customer ID -wk2  Food ID -wk2
0                 537             9               688            10
1                  97             4               813             7
2                 658             1               495            10
3                 202             2               189             5
4                 155             9               267             3
..                ...           ...               ...           ...
245               413             9               783            10
246               926             6               556            10
247               134             3               547             9
248               396             6               252             9
249               535            10               249             6

[250 rows x 4 columns]

## The .join() Method

In [94]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
foods = pd.read_csv("Restaurant - Foods.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
satisfaction = pd.read_csv("Restaurant - Week 1 Satisfaction.csv")

In [96]:
week1.head(2)

   Customer ID  Food ID
0          537        9
1           97        4

In [95]:
satisfaction.head(2)

   Satisfaction Rating
0                    2
1                    7

In [97]:
# merge method
week1.merge(satisfaction, how="left", left_index=True, right_index=True)

     Customer ID  Food ID  Satisfaction Rating
0            537        9                    2
1             97        4                    7
2            658        1                    3
3            202        2                    7
4            155        9                   10
..           ...      ...                  ...
245          413        9                    1
246          926        6                    2
247          134        3                    8
248          396        6                   10
249          535       10                    3

[250 rows x 3 columns]

In [98]:
# join method -- much less code
week1.join(satisfaction)

     Customer ID  Food ID  Satisfaction Rating
0            537        9                    2
1             97        4                    7
2            658        1                    3
3            202        2                    7
4            155        9                   10
..           ...      ...                  ...
245          413        9                    1
246          926        6                    2
247          134        3                    8
248          396        6                   10
249          535       10                    3

[250 rows x 3 columns]

## The pd.merge() Method

In [99]:
week1 = pd.read_csv("Restaurant - Week 1 Sales.csv")
week2 = pd.read_csv("Restaurant - Week 2 Sales.csv")
foods = pd.read_csv("Restaurant - Foods.csv")
customers = pd.read_csv("Restaurant - Customers.csv")
satisfaction = pd.read_csv("Restaurant - Week 1 Satisfaction.csv")

In [100]:
week1.head(3)

   Customer ID  Food ID
0          537        9
1           97        4
2          658        1

In [101]:
customers.head(3)

   ID First Name Last Name  Gender  Company                     Occupation
0   1     Joseph   Perkins    Male  Dynazzy  Community Outreach Specialist
1   2   Jennifer   Alvarez  Female     DabZ        Senior Quality Engineer
2   3      Roger     Black    Male  Tagfeed              Account Executive

In [102]:
pd.merge(week1,customers,how="left",left_on="Customer ID", right_on = "ID")

,Customer ID,Food ID,ID,First Name,Last Name,Gender,Company,Occupation
0,537,9,537,Cheryl,Carroll,Female,Zoombeat,Registered Nurse
1,97,4,97,Amanda,Watkins,Female,Ozu,Account Coordinator
2,658,1,658,Patrick,Webb,Male,Browsebug,Community Outreach Specialist
3,202,2,202,Louis,Campbell,Male,Rhynoodle,Account Representative III
4,155,9,155,Carolyn,Diaz,Female,Gigazoom,Database Administrator III
...,...,...,...,...,...,...,...,...
245,413,9,413,Diane,Bailey,Female,Wikibox,Technical Writer
246,926,6,926,Anne,Wagner,Female,Skyba,Legal Assistant
247,134,3,134,Diana,Hall,Female,Quinu,Financial Advisor
248,396,6,396,Juan,Romero,Male,Zoonder,Analyst Programmer
249,535,10,535,Nancy,Cox,Female,Trudeo,Research Associate